#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <math.h>
#include <string.h>
#include <time.h>
#include <windows.h>
#include <stdlib.h>


//一堆数组：一维数组、二维数组、三维数组、多维数组（前两者最常用）
//数组- 一组数（一种相同类型元素的集合）
//int main()
//{
//	char ch[4] = { 'b','i','t'};
//	printf("%s\n", ch);
//	return 0;
//}


//%p - 是按地址的格式打印  %x - 十六进制的打印(0~9 abcdef):a对应10，b对应11，c对应12，d对应13，e对应14，f对应15

//int main()
//{
//	/*printf("%x\n", 0x12);
//	printf("%p\n", 0x12);*/
//	
//	
//
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("&arr[%d] = %p\n",i, &arr[i]);
//	}
//	return 0;
//}

//1.一维数组在内存中是连续存放的
//2.随着数组下标的增长，地址是由低到高变化的

//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr;//arr是数组名，数组名是数组首元素的地址，1的地址是整型的地址，所有放到整型的指针p里面去，现在p里面存的地址就是指向1的
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *p);//对p解应用就找到了1
//		p++;
//	}
//}



//二维数组的创建
//int arr[3][4];
//char arr[3][4];
//double arr[3][4];


//二维数组的初始化
//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10 ,11,12};//调试看看（完全初始化）
//int arr[3][4] = { 1,2,3,4,5,6,7};//调试看看（不完全初始化后面补\0）
//
//int arr[3][4] = { { 1,2 }, {4, 5 } };
//int arr[][4] = { { 2,3 }, {4, 5 } };//行可以省略（根据初始化内容来确定你有几行），列不可省略
//因为如果列省略了，就不知道一行有几个元素了，不知道一行有几个元素，那么第二行就不知道从哪开始，后面的行也是如此，所以列不可省略


//二维数组的使用
//int main()
//{
//	int arr[][4] = { {1,2},{3,4},{4,5} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ",arr[i][j]);
//		}
//		printf("\n");
//	}
//}


//二维数组在数组中存储

//int main()
//{
//	int arr[][4] = { {1,2},{3,4},{4,5} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);
//		}
//	}
//}

//二维数组在内存中也是连续存放的（行内部连续，跨行也是连续的）


int main()
{
	int arr[][4] = { {1,2},{3,4},{4,5} };
	int i = 0;
	int j = 0;
	int* p = &arr[0][0];//整型元素的地址应该放到整型指针里面去
	for (i = 0; i < 12; i++)
	{
		printf("%d ", *p);//p是地址，*p是该地址内存储的值，对地址p++，代表对地址p+1跳到下一个元素
		p++;
	}
}

